БухЭксп/DataProcessors/CW_РабочийСтол_БЭ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>CW_РабочийСтол_БЭ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

БухЭксп/Enums/CW_МеханизмыРаскраскиСписковМониторинга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_МеханизмыРаскраскиСписковМониторинга</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеРаскрашивать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныеЦвета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦветаСтатусов</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПодключаемыеОбъекты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПодключаемыеОбъекты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПодсистемы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вид</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Встроенная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияФайла</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Настройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаСубъекта</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтладкаИмяОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеВида</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерФайла</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасполагатьНаРабочемСтоле</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранилищеОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнегоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ТипыПодключаемыхОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяВстроеннойОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонПредставленияПечатнойФормы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МинимальнаяВерсияМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсторияИзменений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>МетодыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Метод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ФормыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КомандыОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнаяКоманда</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДоступностьОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ГруппаПользователей</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ГруппыПользователей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасположениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Расположение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_РазделыРабочегоСтола</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыВнешнейКоманды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПредставлениеКоманды</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетаданныеКонфигурации</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяФормыОбъкта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяТабличнойЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяКартинки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Индекс</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппыДоступаКоманды</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасположениеГруппы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПередЭлементом</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НазначениеОбъекта</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Назначение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Макросы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредставлениеМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МетодМакроса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/DataProcessors/CW_РабочийСтол_БЭ/Forms/ФормаУправляемая/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СкрытьЭлементыИнформацииОбОбновлениях();  
	
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь,Истина);
	
	РежимОтладкиВключен = CW_Настройки.ПолучитьНастройкуПользователя(,"РежимОтладкиВключен");
	
	CW_БухгалтерияЭкспедитораСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);

	Элементы.ЗаголовокРабочегоСтола.Видимость = (НЕ ТекущийРежимЗапуска() = РежимЗапускаКлиентскогоПриложения.УправляемоеПриложение);
	
	УстановитьПраваДоступаНаСервере();
	_УправлениеЭлементамиФормы();
	
	ОбновитьСписокВнешнихОтчетовИОбработок();  
	
	ОбязательныеРасширенияУстановлены();
	Если ОбязательныеРасширенияУстановлены Тогда
		УстановитьЗапускРабочегоСтола();           
	КонецЕсли;
	
	ГруппаПользователя 			= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	ЭтоПолноправныйПользователь = CW_ПраваДоступа.ЭтоПолноправныйПользователь(ПараметрыСеанса.ТекущийПользователь, Истина); 
	
	БлокироватьРаботу 			= НЕ ЭтоПолноправныйПользователь и Не ЗначениеЗаполнено(ГруппаПользователя)
									или Не ОбязательныеРасширенияУстановлены;
	
	УстанавилваемыеПараметры = Новый Структура("CW_ГруппаПользователя",ГруппаПользователя); 
	УстановитьПараметрыФункциональныхОпцийФормы(УстанавилваемыеПараметры);
	
	Элементы.ДокументCW_РеестрПлатежейОткрытьСписок.Видимость = ПолучитьФункциональнуюОпцию("CW_РольКазначея", УстанавилваемыеПараметры);
	
	//Подсистема.ЛичныйКабинет    
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитора.CW_ЛичныйКабинетКлиента") Тогда   
		Модуль_CW_ЛичныйКабинетКлиентаСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_ЛичныйКабинетКлиентаСервер");
		Модуль_CW_ЛичныйКабинетКлиентаСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	КонецЕсли;
	//Подсистема.ЛичныйКабинет   
	
	//Подсистема.CW_РеестрыНДС0 
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда   
		Модуль_CW_РеестрыНДС0Сервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_РеестрыНДС0Сервер");
		Модуль_CW_РеестрыНДС0Сервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
		Модуль_CW_РеестрыНДС0Сервер.УстановитьПараметрСеансаРеестрыНДС0(Не ИспользуетсяСервисРеестрНДС);
	КонецЕсли;
	//Подсистема.CW_РеестрыНДС0   
	
	//Подсистема.CW_ДоходыНерезидентов 
	Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_ДоходыНерезидентов") Тогда   
		Модуль_CW_ДоходыНерезидентовСервер = CW_ОбщегоНазначения.ОбщийМодуль("CW_ДоходыНерезидентовСервер");
		Модуль_CW_ДоходыНерезидентовСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка); 
	КонецЕсли;
	//Подсистема.CW_ДоходыНерезидентов    
	
	ЭтаФорма.Заголовок = ПолучитьЗаголовокФормыНаСервере();

	//Подсистема ДополнительныеРеквизиты    
	CW_ДополнительныеРеквизитыСлужебный.УстановитьПрименениеДополнительныхРеквизитов();  
	//Конец Подсистема ДополнительныеРеквизиты   
	
	// по заявке  AFR-233641
	Элементы.Группа13.Доступность = РольДоступна("ПолныеПрава");
	Элементы.Группа11.Доступность = РольДоступна("ПолныеПрава");
	// по заявке  AFR-233641   
	
КонецПроцедуры

&НаСервере
Процедура ОбязательныеРасширенияУстановлены()
	
	ОбязательныеРасширенияУстановлены = Справочники.CW_ОбязательныеРасширения.ОбязательныеРасширенияУстановлены();

КонецПроцедуры

&НаСервере
Процедура УстановитьЗапускРабочегоСтола()
	
	Попытка
		НовыйСеанс = НЕ ПараметрыСеанса.CW_РабочийСтолЗапущен;
	Исключение
		НовыйСеанс = Истина;
	КонецПопытки;  
	
	ПараметрыСеанса.CW_РабочийСтолЗапущен = Истина;

КонецПроцедуры

&НаСервере
Процедура СкрытьЭлементыИнформацииОбОбновлениях()
	
	Элементы.ГруппаНаличиеОбновлений.Видимость  = Ложь;
	Элементы.ГруппаИсправления.Видимость 		= Ложь;
	Элементы.ГруппаДополнения.Видимость 		= Ложь;
	Элементы.ГруппаОбновить.Видимость 			= Ложь;

КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	
	//Первый запуск программы
	Если ЭтоПервыйЗапуск Тогда 
		Отказ = Истина;
		ОткрытьФорму("ОбщаяФорма.CW_ПервыйЗапуск"); 
		ЭтаФорма.Закрыть();
		//Первый запуск программы 
	КонецЕсли;       
	
	Если ТребуетсяОбновление Тогда
		Элементы.ДекорацияНачальная.Заголовок = "Обновление конфигурации...";
		CW_ОбновлениеКонфигурацииКлиент.ВыполнитьОбновлениеКонфигурации(Этаформа);	
	Иначе  
		
		Если Не ОбязательныеРасширенияУстановлены Тогда
			Отказ = истина;
			
			Если БлокироватьРаботу и Не ЭтоПолноправныйПользователь Тогда
				Элементы.ДекорацияНачальная.Заголовок = "";
				Оповещение = Новый ОписаниеОповещения("ПослеПредупрежденияОбУстанвокеРасширенийПриСтарте", ЭтотОбъект);
				ПоказатьПредупреждение(Оповещение, "Не установлены обязательные расширения. Обратитесь к администратору системы.");
			Иначе
				Элементы.ДекорацияНачальная.Заголовок = "Установка обязательных расширений...";      
				Оповещение = Новый ОписаниеОповещения("ПослеУстановкиОбязательныхРасширенийПриСтарте", ЭтотОбъект);
				ОткрытьФорму("ОбщаяФорма.CW_ФормаПроверкиИсправлений",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс); 
			КонецЕсли;   
			
		Иначе
			ПродолжитьОткрытиеФормы(Неопределено, Неопределено);  
			Элементы.СтраницыОсновногоРаздела.ТекущаяСтраница = Элементы.СтраницаРабочийСтол; 
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры   

&Наклиенте
Процедура ПослеПредупрежденияОбУстанвокеРасширенийПриСтарте(ДополнительныеПараметры) Экспорт
	
	ВключитьНачальнуюСтраницуБухгалтерияПредприятия();
	ПерезапуститьСистему();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеУстановкиОбязательныхРасширенийПриСтарте(Результат, ДополнительныеПараметры) Экспорт
	
	ОбязательныеРасширенияУстановлены();
	Если Не ОбязательныеРасширенияУстановлены Тогда
		ВключитьНачальнуюСтраницуБухгалтерияПредприятия();
	КонецЕсли;
	
	ПерезапуститьСистему();
	
КонецПроцедуры

&НаКлиенте
Процедура ПерезапуститьСистему()
	
	// По завершении сеанса необходимо начать новый сеанс
	глНеобходимостьПерезапуска = Истина;
	
	// Попробуем перезапустить
	ЗавершитьРаботуСистемы(Истина,Истина);

КонецПроцедуры

&НаСервере
Процедура ВключитьНачальнуюСтраницуБухгалтерияПредприятия()   
	
	CW_БухгалтерияЭкспедитораСервер.ВключитьНачальнуюСтраницуБухгалтерияПредприятия(); 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередНачаломПроверкиОбновлений()
	
	НачатьПроверкуОбновлений();
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПроверкуОбновлений(ВыводитьОкноОжидания=Ложь, ЗапуститьВФоне=Истина)

	РезультатВыполнения =  ПродолжитьПроверкуОбновленийНаСервереВФоне(ЗапуститьВФоне);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьОкноОжидания = ВыводитьОкноОжидания; 
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОбработатьРезультатВыполненияПроверкиОбновлений", ЭтотОбъект); 
	ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания); 	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЗавешитьРасширенныеНастройкиМодуля(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Истина Тогда      
		Отказ = ложь;
	Иначе    
		ЭтаФорма.Закрыть();
		УбратьРабочийСтолИзНачальнойНастройки();
		ОбновитьИнтерфейс();
	КонецЕсли;    
	
КонецПроцедуры  

&НаКлиенте
Процедура ПродолжитьОткрытиеФормы(Результат, ДополнительныеПараметры) Экспорт
	
	Если БлокироватьРаботу Тогда
		УбратьРабочийСтолИзНачальнойНастройки();
		ОбновитьИнтерфейс();
		
		Отказ = истина;
		ПоказатьПредупреждение(, "Текущая учетная запись не включена ни в одну группу пользователей. 
		|Работа с программой не возможна. Обратитесь к администратору системы.");
		
		Возврат;
	КонецЕсли;   
	
	CW_БухгалтерияЭкспедитораКлиент.ПриОткрытии(ЭтаФорма, Отказ);
	
	//Подсистема.ОбновлениеКонфигурации
	Если ВыполнитьПроверкуНаличияОбновлений Тогда  
		ПередНачаломПроверкиОбновлений();
		ПодключитьОбработчикОжидания("ПередНачаломПроверкиОбновлений", 3600);
	КонецЕсли; 
	//Подсистема.ОбновлениеКонфигурации

	Если НовыйСеанс Тогда
	
		//Подсистема.СогласованиеОбъктов
		CW_СогласованиеКлиент.ПодключитьОбработчикиОжиданияСогласования();
		//Подсистема.СогласованиеОбъктов
		
		Если Не СоответствуетТиповойБухгалтерии И НЕ РежимОтладкиВключен Тогда
			ТекстПредупреждения = "Версия конфигурации ""1С:Бухгалтерия предприятия 8"" (" + ТекущаяВерсияБП + ") не соответствует рекомендуемой (" + РекомендуемаяВерсияБП + "). Для корректной работы модуля ""Бухгалтерия экспедитора 8"" обновите версию конфигурации ""1С:Бухгалтерия предприятия 8"" до рекомендованной.";
			ПоказатьПредупреждение(, ТекстПредупреждения);
		КонецЕсли; 
		
		//Подсистема.ЛичныйКабинет
		Если Не ИспользуетсяЛичныйКабинет Тогда
			ПодключитьОбработчикОжидания("ЗапуститьРекламныйБаннерЛКК", 1, Истина);
		КонецЕсли;
		//Подсистема.ЛичныйКабинет
		
		//Подсистема.CW_РеестрыНДС0
		Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_РеестрыНДС0") Тогда   
			Если Не ИспользуетсяСервисРеестрНДС Тогда
				ПодключитьОбработчикОжидания("ЗапуститьРекламныйБаннерРеестрыНДС0", 1, Истина);
			КонецЕсли;  
		КонецЕсли;  
		//Подсистема.CW_РеестрыНДС0

		//Подсистема.CW_ДоходыНерезидентов
		Если CW_ВерсииПодсистемСервер.СуществуетПодсистема("CW_БухгалтерияЭкспедитораДляРоссии.CW_ДоходыНерезидентов") Тогда  
			Если Не ИспользуетсяСервисДоходыНерезидентов Тогда
				ПодключитьОбработчикОжидания("ЗапуститьРекламныйБаннерДоходыНерезидентов", 1, Истина);
			КонецЕсли;  
		КонецЕсли;  
		//Подсистема.CW_ДоходыНерезидентов  
		
	КонецЕсли;
	
КонецПроцедуры  

 &НаСервере
Процедура УбратьРабочийСтолИзНачальнойНастройки() 
	
	CW_БухгалтерияЭкспедитораСервер.ОтключитьРабочийСтолБухгалтерияЭкспедитора();
	
КонецПроцедуры 

 &НаСервере
Процедура ВключитьРабочийСтолВНачальныеНастройки() 
	
	CW_БухгалтерияЭкспедитораСервер.ВключитьРабочийСтолБухгалтерияЭкспедитора();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьПраваДоступаНаСервере()       
	
	ПросмотрФинансов 			= ЭтоПолноправныйПользователь или CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов");
	ПросмотрРасходов 			= ЭтоПолноправныйПользователь или CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Расходы");
	ПросмотрДоходов 			= ЭтоПолноправныйПользователь или CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Доходы");
	АнализЭкономики 			= ЭтоПолноправныйПользователь или CW_ПраваДоступа.ПравоДоступно("АнализЭкономикиГрузоперевозок");
	ПросмотрОплатБУ 			= ЭтоПолноправныйПользователь или CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_Оплаты");
	ПросмотрОплатОУ 			= ЭтоПолноправныйПользователь или CW_ПраваДоступа.ПравоДоступно("ПросмотрФинансов_ОперативныйУчет");
	УправлениеОбменамиДанных 	= ЭтоПолноправныйПользователь или CW_ПраваДоступа.ПравоДоступно("УправлениеОбменамиДанных");
	РедактированиеВозвратаОригиналовОтПоставщика = ЭтоПолноправныйПользователь или CW_ПраваДоступа.ПравоДоступно("РедактированиеВозвратаОригиналовОтПоставщика");
	РедактированиеВозвратаОригиналовОтКлиента = ЭтоПолноправныйПользователь или CW_ПраваДоступа.ПравоДоступно("РедактированиеВозвратаОригиналовОтКлиента"); 
	
	Элементы.СтраницаДокументы.Видимость = ЭтоПолноправныйПользователь или ПросмотрФинансов;
	Элементы.СтраницаОтчеты.Видимость = ЭтоПолноправныйПользователь или ПросмотрФинансов;

	Элементы.Документ__CW_РасходыПоГрузоперевозке.Видимость = ПросмотрРасходов;
	Элементы.Документ__CW_ДоходыПоГрузоперевозке.Видимость = ПросмотрДоходов;
	Элементы.Документ__CW_ЗакрытиеГрузоперевозки.Видимость = (ПросмотрРасходов И ПросмотрДоходов И ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам"));
	Элементы.Документ__CW_КорректировкаПеревыставления.Видимость = (ПросмотрРасходов И ПросмотрДоходов);

	Элементы.ГруппаПлатежноРасчетныеДокументыОУ.Видимость = ПросмотрОплатОУ;
	Элементы.ГруппаДенежныеСредства.Видимость = ПросмотрОплатОУ;
	Элементы.Справочник__CW_Кассы.Видимость = ПросмотрОплатОУ;
	
	Элементы.ГруппанпПеревыставляемыеЗатраты.Видимость = (ПросмотрРасходов И ПросмотрДоходов);
	Элементы.ГруппанпПеревыставлениеПоСтавкам.Видимость = (ПросмотрРасходов И ПросмотрДоходов) И ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	Элементы.ГруппанпФинансовыйРезультатИВознаграждение.Видимость = (ПросмотрРасходов И ПросмотрДоходов);
	Элементы.Отчет__CW_АнализПрибылиПоГрузоперевозкам.Видимость = АнализЭкономики;  
	
	// группа "Бухгалтерская задолженность"
	Элементы.Отчет__CW_ВедомостьВзаиморасчетовСПоставщиками.Видимость = ПросмотрРасходов и ПросмотрОплатБУ;
	Элементы.Отчет__CW_ВедомостьВзаиморасчетовСПокупателями.Видимость = ПросмотрДоходов и ПросмотрОплатБУ;
	Элементы.Отчет__CW_ОтсутствующиеОригиналыДокументов.Видимость = (ПросмотрРасходов и РедактированиеВозвратаОригиналовОтПоставщика)  ИЛИ (ПросмотрДоходов и РедактированиеВозвратаОригиналовОтКлиента);
	Элементы.Отчет__CW_АктСверкиВзаиморасчетов.Видимость = (ПросмотрРасходов и ПросмотрДоходов и РедактированиеВозвратаОригиналовОтКлиента); 
	
	Элементы.ГруппаОперативныйУчетСПоставщиками.Видимость = (ПросмотрРасходов И ПросмотрОплатОУ);
	Элементы.ГруппаОперативныйУчетСПокупателями.Видимость = (ПросмотрДоходов И ПросмотрОплатОУ);
	
	Элементы.Справочник__CW_ФинансовыеСтатусы.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользоватьФинансовыеСтатусыГрузоперевозок");
	Элементы.Справочник__CW_Грузоперевозки.Видимость 	= CW_ПраваДоступа.ПравоДоступно("ПравоПросмотраГрузоперевозокБезОграниченийДоступа");
	Элементы.Справочник__CW_Заказы.Видимость 			= CW_ПраваДоступа.ПравоДоступно("ДоступенСписокЗаказов");
	Элементы.СправочникCW_ЗаявкиОткрытьСписок.Видимость = CW_ПраваДоступа.ПравоДоступно("ДоступенСписокЗаявок");
	
	Элементы.Справочник__CW_Рейсы.Видимость = ПолучитьФункциональнуюОпцию("CW_ИспользованиеРейсов");
	Элементы.Справочник__CW_Цвета.Видимость = (Константы.CW_МеханизмРаскраскиСписковМониторинга.Получить() = Перечисления.CW_МеханизмыРаскраскиСписковМониторинга.ПроизвольныеЦвета);
	Элементы.Документ__CW_ПроектыДТ.Видимость = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетДТ");
	
	
	ВедетсяУчетИмпортныхТоваров 	 = Истина;
	ОпцияВедетсяУчетИмпортныхТоваров = Метаданные.ФункциональныеОпции.Найти("ВедетсяУчетИмпортныхТоваров");
	Если ОпцияВедетсяУчетИмпортныхТоваров <> Неопределено Тогда
		ВедетсяУчетИмпортныхТоваров = ПолучитьФункциональнуюОпцию("ВедетсяУчетИмпортныхТоваров");
	КонецЕсли;
	Элементы.Справочник__НомераГТД.Видимость = ВедетсяУчетИмпортныхТоваров;
	Элементы.Справочник__CW_СистемныеСообщения.Видимость = CW_ПраваДоступа.ПравоДоступно("ПросмотрСистемныхСообщений");
	
	// доступ к блоку определяется функциональной опцией и правом пользователя
	Элементы.ГруппаЦРМ.Видимость = Константы.CW_ИспользованиеCRM.Получить() И (CW_ПраваДоступа.ПравоДоступно("РедактированиеCRM") или ЭтоПолноправныйПользователь);

КонецПроцедуры

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	
	// Автоблок
	ИспользованиеБлокаСобственногоТранспорта 	= ПолучитьФункциональнуюОпцию("CW_ИспользованиеБлокаСобственногоТранспорта");
	ПрименяютсяНормативыРасходаТоплива 			= ПолучитьФункциональнуюОпцию("CW_ПрименяютсяНормативыРасходаТоплива");
	ВедетсяУчетШинТранспортногоСредства 		= ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетШинТранспортногоСредства");
	РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки = ПолучитьФункциональнуюОпцию("CW_РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки");     
	ДоступенБлокАвтотранспорт 					= CW_ПраваДоступа.ПравоДоступно("ДоступенБлокАвтотранспорт");
	РедактированиеСтатусовДокументов 			= CW_ПраваДоступа.ПравоДоступно("РедактированиеСтатусовДокументов");
	
	Элементы.ГруппаТранспортныеСредства.Видимость 					= ИспользованиеБлокаСобственногоТранспорта и ДоступенБлокАвтотранспорт; 
	Элементы.СтраницаСобственныйАвтотранспорт.Видимость 			= ИспользованиеБлокаСобственногоТранспорта и ДоступенБлокАвтотранспорт;
	Элементы.ГруппаАвтотранспортНормативныйРасчетТоплива.Видимость	= ПрименяютсяНормативыРасходаТоплива;
	Элементы.Документ__CW_ШиномонтажТС.Видимость 					= ВедетсяУчетШинТранспортногоСредства;

	ВалютаРегламентированногоУчетаРубль = ПолучитьФункциональнуюОпцию("CW_ВалютаРегламентированногоУчетаРубль");
	
	//ФИНАНСЫ
	Элементы.ПС__Хозрасчетный.Видимость  													= ВалютаРегламентированногоУчетаРубль;
	Элементы.РегистрСведений__CW_СоответствиеНоменклатурныхГруппСпособамУчетаНДС.Видимость 	= ВалютаРегламентированногоУчетаРубль;
	Элементы.Документ__УстановкаЦенНоменклатуры.Видимость 									= ВалютаРегламентированногоУчетаРубль;
	Элементы.Справочник__Валюты.Видимость  													= ВалютаРегламентированногоУчетаРубль;
	Элементы.РегистрСведений__CW_НастройкаПолученияКоличестваИзПараметровГрузоперевозки.Видимость = РазрешитьПолучениеКоличестваУслугИзпараметраГрузоперевозки;
	Элементы.СправочникCW_СтатусыДокументовОткрытьСписок.Видимость 							= РедактированиеСтатусовДокументов;
	
	//Документы
	Элементы.ГруппаПлатежноРасчетныеДокументыБУ.Видимость			= ВалютаРегламентированногоУчетаРубль и ПросмотрОплатБУ;
	Элементы.Документ__CW_КорректировкаАктированияСчетов.Видимость	= ВалютаРегламентированногоУчетаРубль;
	
	//Отчеты
	Элементы.Отчет__CW_КонтрольПеревыставленияПоСтавкам.Видимость		= ВалютаРегламентированногоУчетаРубль;
	Элементы.Отчет__CW_КонтрольПеревыставленияЗатрат.Видимость			= ВалютаРегламентированногоУчетаРубль;
	Элементы.Отчет__CW_ВознаграждениеПоГрузоперевозкам.Видимость		= ВалютаРегламентированногоУчетаРубль;
	Элементы.Отчет__CW_ОтчетАгента.Видимость							= ВалютаРегламентированногоУчетаРубль;
	Элементы.Отчет__CW_НеАктированыеИсходящиеСчета.Видимость			= ВалютаРегламентированногоУчетаРубль;
	Элементы.Отчет__CW_НеАктированыеВходящиеСчета.Видимость				= ВалютаРегламентированногоУчетаРубль;
	Элементы.Отчет__CW_ВедомостьАктированияИсходящихСчетов.Видимость	= ВалютаРегламентированногоУчетаРубль;
	Элементы.Отчет__CW_ВедомостьАктированияВходящихСчетов.Видимость		= ВалютаРегламентированногоУчетаРубль;
	Элементы.ГруппаКонтрольЗадолженности.Видимость					    = ВалютаРегламентированногоУчетаРубль;
	
	ДоступныеТипыПоОпциямЛогистическиеСтатусы = CW_ЛогистическиеСтатусыСервер.ПолучитьДоступныеТипыПоОпциям();
	Элементы.СправочникCW_ЛогистическиеСтатусыОткрытьСписок.Видимость = ДоступныеТипыПоОпциямЛогистическиеСтатусы.Количество() > 0;
	
	ДоступныеТипыПоОпциямФинансовыеСтатусы = CW_ФинансовыеСтатусыСервер.ПолучитьДоступныеТипыПоОпциям();
	Элементы.Справочник__CW_ФинансовыеСтатусы.Видимость = ДоступныеТипыПоОпциямФинансовыеСтатусы.Количество() > 0;

КонецПроцедуры
  
&НаКлиенте
Процедура КомандаДействие(Команда)
	
	ИмяЭлемента = Этаформа.ТекущийЭлемент.Имя;
	
	Строки = СтрЗаменить(ИмяЭлемента,"__",Символы.ПС);
	МассивСтрок = Новый Массив;
	Для Счетчик = 1 По СтрЧислоСтрок(Строки) Цикл
		
		МассивСтрок.Добавить(СтрПолучитьСтроку(Строки,Счетчик));
		
	КонецЦикла; 
	
	Если МассивСтрок.Количество() = 2 Тогда 
		ТипЭлемента = МассивСтрок[0];
		ЗначениеЭлемента = МассивСтрок[1];
	Иначе 
		Возврат;
	КонецЕсли;
	
	Если ТипЭлемента = "Справочник" Тогда
		
		ОткрытьФорму("Справочник."+ЗначениеЭлемента+".ФормаСписка");
		
	ИначеЕсли ТипЭлемента = "Документ" Тогда 
		
		ОткрытьФорму("Документ."+ЗначениеЭлемента+".ФормаСписка");
		
	ИначеЕсли ТипЭлемента = "ПС" Тогда 
		
		ОткрытьФорму("ПланСчетов."+ЗначениеЭлемента+".ФормаСписка");
		
	ИначеЕсли ТипЭлемента = "ПВХ" Тогда 
		
		ОткрытьФорму("ПланВидовХарактеристик."+ЗначениеЭлемента+".ФормаСписка");
		
	ИначеЕсли (ТипЭлемента = "ОбщаяФорма") Тогда 
		
		ОткрытьФорму("ОбщаяФорма."+ЗначениеЭлемента); 
		
	ИначеЕсли ТипЭлемента = "Обработка" Тогда 
		Если ЗначениеЭлемента = "CW_ЖурналГрузоперевозок" Тогда
			Если CW_Настройки.ПолучитьНастройкуПользователя(,"ОткрыватьЖурналГрузоперевозокВНовомОкне") Тогда
				ОткрытьФорму("Обработка."+ЗначениеЭлемента+".Форма",,,Новый УникальныйИдентификатор);
			Иначе
				ОткрытьФорму("Обработка."+ЗначениеЭлемента+".Форма");
			КонецЕсли;
		ИначеЕсли ЗначениеЭлемента = "CW_ЖурналЗаявок" Тогда
			Если CW_Настройки.ПолучитьНастройкуПользователя(,"ОткрыватьЖурналЗаявокВНовомОкне") Тогда
				ОткрытьФорму("Обработка."+ЗначениеЭлемента+".Форма",,,Новый УникальныйИдентификатор);
			Иначе
				ОткрытьФорму("Обработка."+ЗначениеЭлемента+".Форма");
			КонецЕсли;
		ИначеЕсли ЗначениеЭлемента = "CW_ЖурналЗаказов" Тогда
			Если CW_Настройки.ПолучитьНастройкуПользователя(,"ОткрыватьЖурналЗаказовВНовомОкне") Тогда
				ОткрытьФорму("Обработка."+ЗначениеЭлемента+".Форма",,,Новый УникальныйИдентификатор);
			Иначе
				ОткрытьФорму("Обработка."+ЗначениеЭлемента+".Форма");
			КонецЕсли;
		Иначе
			ОткрытьФорму("Обработка."+ЗначениеЭлемента+".Форма");
		КонецЕсли;
	ИначеЕсли ТипЭлемента = "Отчет" Тогда 
		
		ОткрытьФорму("Отчет."+ЗначениеЭлемента+".ФормаОбъекта",,,Новый УникальныйИдентификатор);
		
	ИначеЕсли ТипЭлемента = "РегистрСведений" Тогда 
		
		ОткрытьФорму("РегистрСведений."+ЗначениеЭлемента+".ФормаСписка");
		
	ИначеЕсли ТипЭлемента = "РегистрБухгалтерии" Тогда 
		
		ОткрытьФорму("РегистрБухгалтерии."+ЗначениеЭлемента+".ФормаСписка");
		
	ИначеЕсли ТипЭлемента = "Прочее" Тогда 
		
		// ручная обработка
		Если ЗначениеЭлемента = "Банк" Тогда
			
			ИмячФормыВыписки = ПолучитьИмяФормыБанковскиеВыписки();
			Если Не ПустаяСтрока(ИмячФормыВыписки) Тогда
				ОткрытьФорму(ИмячФормыВыписки);
			КонецЕсли; 
			
		ИначеЕсли ЗначениеЭлемента = "Параметры" Тогда 
			
			ОткрытьФорму("ОбщаяФорма.CW_Настройки");
			
		ИначеЕсли ЗначениеЭлемента = "НастройкиПользователя" Тогда 
			
			ОткрытьФорму("РегистрСведений.CW_НастройкиПользователей.ФормаЗаписи",_ПараметрыФормыНастроекПользователя());
			
		ИначеЕсли (ЗначениеЭлемента = "Контрагенты") Тогда 
			
			ИспользуетсяCRM = Ложь;
			Если (ИспользуетсяCRM) Тогда
				
				ОткрытьФорму("ОбщаяФорма.CW_ФормаКонтактнойИнформации");
				
			Иначе
				
				ОткрытьФорму("Справочник."+ЗначениеЭлемента+".ФормаСписка");
				
			КонецЕсли;
			
		ИначеЕсли ЗначениеЭлемента = "CW_ФормаВыбораСотрудникаДляРоли" Тогда
			
			СтруктураПараметровФормы = новый Структура;
			СтруктураПараметровФормы.Вставить("ВозможностьСоздаватьЗаписи"	, истина);
			СтруктураПараметровФормы.Вставить("РежимВыбора"	, Ложь);
			
			ОткрытьФорму("ОбщаяФорма.CW_ФормаВыбораСотрудникаДляРоли",СтруктураПараметровФормы);
			
		КонецЕсли; 
		
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция ПолучитьИмяФормыБанковскиеВыписки()
	Возврат CW_БухгалтерияЭкспедитораСервер.ПолучитьИмяФормыБанковскиеВыписки();
КонецФункции

&НаСервере
Функция ПолучитьЗаголовокФормыНаСервере()  
	
	
	УстановитьПривилегированныйРежим(Истина);  
	
	Пользователь = Строка(CW_Настройки.Пользователь().Наименование);
	Если Пользователь = "" Тогда
		Пользователь = Строка(CW_Настройки.Пользователь().Код);
	КонецЕсли;  
	
	//Подсистема.ОбновлениеКонфигурации  
	УстановленнаяВерсия 	= "";
	ИмяОсновнойПодсистемы 	= CW_ВерсииПодсистемСервер.ИмяОсновнойПодсистемы();
	ВерсииПодсистем 		= CW_ВерсииПодсистемСервер.УстановленныеВерсииПодсистем();
	
	ВерсииПодсистем.Свойство(ИмяОсновнойПодсистемы, УстановленнаяВерсия);
	УстановленнаяВерсия = ?(УстановленнаяВерсия = Неопределено, "0.0.0.0", УстановленнаяВерсия);

	ИмяТекущейКонфигурации	= CW_ВерсииПодсистемСервер.ИмяТекущейКонфигурации(); 
	//Подсистема.ОбновлениеКонфигурации   
	
	ДляВерсииКОРП = "";
	ОбщийМодульВариантыПриложений = CW_ОбщегоНазначения.ОбщийМодуль("ВариантыПриложений");
	Если ОбщийМодульВариантыПриложений <> Неопределено Тогда
		ДляВерсииКОРП =	?(ОбщийМодульВариантыПриложений.ЭтоВерсияКОРП()," КОРП", "");
	КонецЕсли;

	Если ЭтоПервыйЗапуск или ТребуетсяОбновление Тогда
		Возврат ИмяТекущейКонфигурации + ДляВерсииКОРП;
	Иначе
		Возврат ИмяТекущейКонфигурации + ДляВерсииКОРП +" ("+УстановленнаяВерсия+"). Пользователь: "+Пользователь;
	КонецЕсли;
	
	
КонецФункции
 
&НаСервере
Функция _ПараметрыФормыНастроекПользователя()
	// --- 
	
	Пользователь = CW_Настройки.Пользователь();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_НастройкиПользователей.Пользователь
	|ИЗ
	|	РегистрСведений.CW_НастройкиПользователей КАК CW_НастройкиПользователей
	|ГДЕ
	|	CW_НастройкиПользователей.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	ТЗ = Запрос.Выполнить().Выгрузить();
	Если ТЗ.Количество() = 0 Тогда
		
		// создаём
		Запись = РегистрыСведений.CW_НастройкиПользователей.СоздатьМенеджерЗаписи();
		Запись.Пользователь = Пользователь;
		Запись.Записать();
		
	КонецЕсли; 
	
	// пробуем получить ключ
	Отбор = Новый Структура("Пользователь",CW_Настройки.Пользователь());
	Ключ = РегистрыСведений.CW_НастройкиПользователей.СоздатьКлючЗаписи(Отбор);
	// --- 	
	ПФ = Новый Структура("Ключ",Ключ);
	Возврат(ПФ);
	
	// --- 
КонецФункции
 
// ПОДДЕРЖКА

&НаКлиенте
Процедура ДекорацияИсторияВерсийНажатие(Элемент)
	
	ТабличныйДокумент = ПолучитьМакетИсторииВерсий();
	ТабличныйДокумент.Показать("История версий");

КонецПроцедуры

&НаСервере
Функция ПолучитьМакетИсторииВерсий()
	
	Макет = ПолучитьОбщийМакет("CW_ИсторияРелизов"); 
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОтображатьГруппировки = Истина;
	ТабличныйДокумент.ОтображатьЗаголовки = Ложь;
	ТабличныйДокумент.ОтображатьСетку = Ложь;
	
	ТабличныйДокумент.Вывести(Макет);
	
	Возврат ТабличныйДокумент;

КонецФункции



//Подсистема.ОбновлениеКонфигурации
&НаСервере
Функция ПродолжитьПроверкуОбновленийНаСервереВФоне(ЗапуститьВФоне=Истина)
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение    		= 0;  // запускать сразу  
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "";  
	
	ПараметрыВыполнения.ЗапуститьВФоне     = ЗапуститьВФоне;  
	ПараметрыВыполнения.ЗапуститьНеВФоне   = Не ЗапуститьВФоне;   
	
	ПараметрыПроцедуры = Новый Структура;  
	ПараметрыПроцедуры.Вставить("ПроверитьИсправления", Истина);
	ПараметрыПроцедуры.Вставить("ПроверитьДополнения",  Истина);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("CW_ОбновлениеКонфигурацииСервер.ВыполнитьПроверкуОбновленийКонфигурации", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте 
Процедура ОбработатьРезультатВыполненияПроверкиОбновлений(РезультатВыполнения, Дополнительныепараметры) Экспорт
	
	Если РезультатВыполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатВыполнения.Статус = "Выполнено" Тогда    
		
		СтруктраОтвета = ПолучитьИзВременногоХранилища(РезультатВыполнения.АдресРезультата);
		
		Элементы.ГруппаОбновить.Видимость = СтруктраОтвета.ЕстьОбновление 
			или СтруктраОтвета.ЕстьИсправление
			или СтруктраОтвета.ЕстьДополнения;
		
		Элементы.ГруппаНаличиеОбновлений.Видимость  = СтруктраОтвета.ЕстьОбновление;
		Элементы.ГруппаИсправления.Видимость 		= СтруктраОтвета.ЕстьИсправление;
		Элементы.ГруппаДополнения.Видимость 		= СтруктраОтвета.ЕстьДополнения;
		
		Если СтруктраОтвета.ЕстьОбновление Тогда
			НоваяВерсия = СтруктраОтвета.ПоследняяВерсия;
			Элементы.ДекорацияНоваяВерсия.Заголовок = "Доступна новая версия " + СокрЛП(НоваяВерсия); 
		КонецЕсли;
		
	КонецЕсли;  
	
КонецПроцедуры
 //Подсистема.ОбновлениеКонфигурации

&НаКлиенте
Процедура Обновить(Команда)
 
 	НачатьПроверкуОбновлений(Истина);
 
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗакрытияФормыЗагрузкиИсправлений(Ответ, ДополнительныеПараметры) Экспорт 
 
 	НачатьПроверкуОбновлений(Ложь, Ложь);
 
КонецПроцедуры


&НаКлиенте
Процедура ДекорацияСайтНажатие(Элемент)
	
	#Если Вебклиент Тогда 
		ПерейтиПоНавигационнойСсылке("https://www.coralway.ru/products/36");
	#Иначе
		ЗапуститьПриложение("https://www.coralway.ru/products/36");
	#КонецЕсли
	
КонецПроцедуры

#Область Получить_и_открыть_руководство_пользователя
&НаКлиенте
Процедура ДекорацияРуководствоНажатие(Элемент)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПродолжитьПолучениеРуководстваПользователя", ЭтотОбъект);
	
	Если ПроверитьЗаполнениеДанныхПоддержкиНаСервере() Тогда
		ВыполнитьОбработкуОповещения(ОписаниеОповещения, Неопределено);
	Иначе
		ОткрытьФорму("ОбщаяФорма.CW_ФормаЛогинПароль",,ЭтаФорма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьПолучениеРуководстваПользователя(Результат, Параметры) Экспорт   
	
	Если Не ПроверитьПодключениеНаСервере() Тогда
			ПоказатьПредупреждение(,"Не удалось подключиться к сайту технической поддержки.
									|Пожалуйста, убедитесь в корректности логина и пароля.",60);
	
	Иначе
		РезультатВыполнения =  ПолучитьРуководствоПользователяВФоне();
		
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
		ОповещениеОЗавершении = Новый ОписаниеОповещения("ПродолжитьОткрытиеРуководстваПользователя", ЭтотОбъект);
		
		ДлительныеОперацииКлиент.ОжидатьЗавершение(РезультатВыполнения, ОповещениеОЗавершении, ПараметрыОжидания);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьЗаполнениеДанныхПоддержкиНаСервере() 
	
	Возврат CW_МониторПорталаПоддержкиСервер.ЗаполненыДанныеАутентификацииПользователяИнтернетПоддержки();

КонецФункции


&НаКлиенте
Процедура ПродолжитьОткрытиеРуководстваПользователя(РезультатВыполненя, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыполненя.Статус = "Выполнено" Тогда
		Если ЭтоАдресВременногоХранилища(РезультатВыполненя.АдресРезультата) Тогда
			
			Если МожноПоказатьВПриложении() Тогда
				
				ПараметрыОткрытия = Новый Структура;
				ПараметрыОткрытия.Вставить("АдресФайла",	 РезультатВыполненя.АдресРезультата); 
				ПараметрыОткрытия.Вставить("ЗаголовокФормы", "Руководство пользователя"); 
				
				ОткрытьФорму("ОбщаяФорма.CW_ПросмотрPDFФайла", ПараметрыОткрытия);    
				
			Иначе
				ДвоичныеДанные = ПолучитьИзВременногоХранилища(РезультатВыполненя.АдресРезультата);
				
				#Если ВебКлиент Тогда
					ИмяФайла = "РуководствоПользователяБЭ.pdf";
					ПараметрыДиалогаПолученияФайлов = Новый ПараметрыДиалогаПолученияФайлов;
					ПараметрыДиалогаПолученияФайлов.ВыборКаталога = Истина;
					
					НачатьПолучениеФайлаССервера(РезультатВыполненя.АдресРезультата,ИмяФайла, ПараметрыДиалогаПолученияФайлов);	
				#Иначе
					ВременныйФайл = ПолучитьИмяВременногоФайла("pdf");
					ДвоичныеДанные.Записать(ВременныйФайл); 
					
					ЗапуститьПриложение(ВременныйФайл);
				#КонецЕсли      
			КонецЕсли;
		
		КонецЕсли;
	Иначе
		ПоказатьПредупреждение(,"Не удалось загрузить руководство пользователя.
								|Пожалуйста, повторите попытку позднее или
								|обратитесь в техническую поддержку.");
	КонецЕсли;
	
КонецПроцедуры   

&НаСервере
Функция МожноПоказатьВПриложении()
	
	СистемнаяИнформация = Новый СистемнаяИнформация; 
	
	мВерсияПриложения = СтрРазделить(СистемнаяИнформация.ВерсияПриложения,".", Ложь);   
	мМинимальнаяВерсия = СтрРазделить("8.3.21", ".", Ложь);
	
	Для Индекс = 0 по мМинимальнаяВерсия.Количество() - 1 Цикл
		Если мВерсияПриложения[Индекс] >= мМинимальнаяВерсия[Индекс] Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла; 
	
	Возврат Ложь;
	
КонецФункции 


&НаСервере
Функция ПолучитьРуководствоПользователяВФоне()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(Новый УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение 			= 0; // запускать сразу
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "Открытие руководства пользователя";
	ПараметрыВыполнения.ЗапуститьВФоне 				= Истина;
	ПараметрыВыполнения.ЗапуститьНеВФоне 			= ложь;
	
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ДлительныеОперации.ВыполнитьВФоне("Обработки.CW_РабочийСтол_БЭ.ПолучитьРуководствоПользователя", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции


&НаСервере
Функция ПроверитьПодключениеНаСервере()

	ДанныеАутентификации = CW_МониторПорталаПоддержкиСервер.ДанныеАутентификацииПользователяИнтернетПоддержки();

	HTTPСоединение = CW_ИсправленияКонфигурации.ПодключитьсяКРесурусуОбновлений(ДанныеАутентификации.Логин, ДанныеАутентификации.Пароль);
	Возврат НЕ HTTPСоединение = Неопределено;
	
КонецФункции

#КонецОбласти


&НаКлиенте
Процедура ДекорацияУстановленныеИсправленияНажатие(Элемент)
	
	ОткрытьФорму("ОбщаяФорма.CW_УстановленныеИсправления",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияПроверкаИсправленийНажатие(Элемент)
	
	Если НЕ ПроверитьПодключениеНаСервере() Тогда  
		Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВводаЛогинаИПароля", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Не удалось подключиться к серверу техподдержки! Проверьте правильность введенных данных",60,"Проверка подключения");
	Иначе 
		ОткрытьФормуЗагрузкиИсправлений();
	КонецЕсли;   
	
КонецПроцедуры

&НаКлиенте 
Процедура ОткрытьФормуВводаЛогинаИПароля(ДополнительныеПараметры) Экспорт
	
	ОткрытьФорму("ОбщаяФорма.CW_ФормаЛогинПароль", , ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

 &НаКлиенте
Процедура ДекорацияДоступныеИсправленияНажатие(Элемент)
	
	 ОткрытьФормуЗагрузкиИсправлений();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЗагрузкиИсправлений()
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияФормыЗагрузкиИсправлений",ЭтотОбъект); 
	ОткрытьФорму("ОбщаяФорма.CW_ФормаПроверкиИсправлений",,,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры


&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	// --- 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ОбработкаЗаписиНовогоНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработкаЗаписиНовогоНаСервере()
	
	_УправлениеЭлементамиФормы();
	УстановитьПраваДоступаНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОбновитьДанныеРабочегоСтола" Тогда
		
		_УправлениеЭлементамиФормы();
		УстановитьПраваДоступаНаСервере();
		ОбновитьСписокВнешнихОтчетовИОбработок();
		
	ИначеЕсли ИмяСобытия = "ОбновлениеКонфигурации_Успешно" Тогда   
		
		ТребуетсяОбновление = Ложь;
		ЭтаФорма.Заголовок = ПолучитьЗаголовокФормыНаСервере();	 
		Элементы.СтраницыОсновногоРаздела.ТекущаяСтраница = Элементы.СтраницаРабочийСтол;
		
	ИначеЕсли ИмяСобытия = "CW_НастройкиПользователей_Запись" Тогда
		
		//Мы нее знаем что конкретно записали, обновить информаицю об обновлениях
		ВыполнитьПроверкуНаличияОбновлений 	= CW_ОбновлениеКонфигурацииСервер.ВыполнитьПроверкуНаличияОбновлений(); 
		Если ВыполнитьПроверкуНаличияОбновлений Тогда
			НачатьПроверкуОбновлений(Ложь);	             
		Иначе
			СкрытьЭлементыИнформацииОбОбновлениях();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры


#Область Динамическое_обновление_элементов_рабочего_стола

&НаСервере
Процедура ОбновитьСписокВнешнихОтчетовИОбработок()
	
	ГруппаПользователя 			= CW_ПраваДоступа_ПИ.ГруппаПользователя(ПараметрыСеанса.ТекущийПользователь);
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъекты.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_ВсеЭлементы
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты КАК CW_ПодключаемыеОбъекты
	               |ГДЕ
	               |	НЕ CW_ПодключаемыеОбъекты.ПометкаУдаления
	               |	И НЕ CW_ПодключаемыеОбъекты.НеИспользуется
	               |	И CW_ПодключаемыеОбъекты.РасполагатьНаРабочемСтоле
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъектыДоступностьОбъекта.Ссылка КАК Ссылка
	               |ПОМЕСТИТЬ ВТ_Доступные
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты.ДоступностьОбъекта КАК CW_ПодключаемыеОбъектыДоступностьОбъекта
	               |ГДЕ
	               |	CW_ПодключаемыеОбъектыДоступностьОбъекта.ГруппаПользователей = &ГруппаПользователеля
	               |	И НЕ CW_ПодключаемыеОбъектыДоступностьОбъекта.Ссылка.НеИспользуется
	               |	И НЕ CW_ПодключаемыеОбъектыДоступностьОбъекта.Ссылка.ПометкаУдаления
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеЭлементы.Ссылка КАК Ссылка,
	               |	ВЫБОР
	               |		КОГДА &ЭтоПолноправныйПользователь
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ВЫБОР
	               |				КОГДА ВТ_Доступные.Ссылка ЕСТЬ NULL
	               |					ТОГДА ЛОЖЬ
	               |				ИНАЧЕ ИСТИНА
	               |			КОНЕЦ
	               |	КОНЕЦ КАК Доступен
	               |ИЗ
	               |	ВТ_ВсеЭлементы КАК ВТ_ВсеЭлементы
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Доступные КАК ВТ_Доступные
	               |		ПО ВТ_ВсеЭлементы.Ссылка = ВТ_Доступные.Ссылка";
	
	Запрос.УстановитьПараметр("ГруппаПользователеля"		, ГруппаПользователя);	
	Запрос.УстановитьПараметр("ЭтоПолноправныйПользователь"	, ЭтоПолноправныйПользователь);	

	РезультатЗапроса = Запрос.Выполнить();
	
	мОбъектыУдалить 	= Новый Массив;
	мОбъектыДобавить 	= Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Доступен Тогда
			мОбъектыДобавить.Добавить(Выборка.Ссылка);	
		КонецЕсли;
		
		мОбъектыУдалить.Добавить(Выборка.Ссылка);	
		
	КонецЦикла;
	
	//Удаление команд
	Запрос = Новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъектыКомандыОбъекта.Ссылка КАК Ссылка,
	               |	CW_ПодключаемыеОбъектыКомандыОбъекта.ИмяКоманды КАК ИмяКоманды,
	               |	CW_ПодключаемыеОбъектыРасположениеОбъекта.Расположение КАК Расположение
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты.КомандыОбъекта КАК CW_ПодключаемыеОбъектыКомандыОбъекта
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CW_ПодключаемыеОбъекты.РасположениеОбъекта КАК CW_ПодключаемыеОбъектыРасположениеОбъекта
	               |		ПО CW_ПодключаемыеОбъектыКомандыОбъекта.Ссылка = CW_ПодключаемыеОбъектыРасположениеОбъекта.Ссылка
	               |ГДЕ
	               |	CW_ПодключаемыеОбъектыКомандыОбъекта.Ссылка.РасполагатьНаРабочемСтоле = ИСТИНА";
	
	Запрос.УстановитьПараметр("мОбъектыУдалить", мОбъектыУдалить);	
	
	Выборка_Удалить = Запрос.Выполнить().Выбрать();
	Пока Выборка_Удалить.Следующий() Цикл
		ИмяКоманды = ПолучитьИмяКомандыВнешнего(Выборка_Удалить.Ссылка.УникальныйИдентификатор(),Выборка_Удалить.Расположение, Выборка_Удалить.ИмяКоманды);
		ОбработатьУдалениеЭлемента(ИмяКоманды);
	КонецЦикла;
	
	//Добавление команд
	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПодключаемыеОбъектыКомандыОбъекта.Ссылка КАК Ссылка,
	               |	CW_ПодключаемыеОбъектыРасположениеОбъекта.Расположение КАК Расположение,
	               |	CW_ПодключаемыеОбъектыКомандыОбъекта.ИмяКоманды КАК ИмяКоманды,
	               |	CW_ПодключаемыеОбъектыКомандыОбъекта.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	CW_ПодключаемыеОбъектыКомандыОбъекта.ИмяКартинки КАК ИмяКартинки
	               |ПОМЕСТИТЬ ВТ_ДобавляемыеОбъекты
	               |ИЗ
	               |	Справочник.CW_ПодключаемыеОбъекты.КомандыОбъекта КАК CW_ПодключаемыеОбъектыКомандыОбъекта
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.CW_ПодключаемыеОбъекты.РасположениеОбъекта КАК CW_ПодключаемыеОбъектыРасположениеОбъекта
	               |		ПО CW_ПодключаемыеОбъектыКомандыОбъекта.Ссылка = CW_ПодключаемыеОбъектыРасположениеОбъекта.Ссылка
	               |ГДЕ
	               |	CW_ПодключаемыеОбъектыКомандыОбъекта.Ссылка В(&мОбъектыДобавить)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	CW_РазделыРабочегоСтола.Ссылка КАК ГруппаФормы
	               |ИЗ
	               |	Справочник.CW_РазделыРабочегоСтола КАК CW_РазделыРабочегоСтола
	               |ГДЕ
	               |	CW_РазделыРабочегоСтола.Ссылка В
	               |			(ВЫБРАТЬ
	               |				ВТ_ДобавляемыеОбъекты.Расположение КАК Расположение
	               |			ИЗ
	               |				ВТ_ДобавляемыеОбъекты КАК ВТ_ДобавляемыеОбъекты)
	               |ИТОГИ ПО
	               |	ГруппаФормы ТОЛЬКО ИЕРАРХИЯ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДобавляемыеОбъекты.Ссылка КАК ПодключаемыйОбъект,
	               |	ВТ_ДобавляемыеОбъекты.Ссылка.Индекс КАК Индекс,
	               |	ВТ_ДобавляемыеОбъекты.ИмяКартинки КАК ИмяКартинки,
	               |	ВТ_ДобавляемыеОбъекты.ИмяКоманды КАК ИмяКоманды,
	               |	ВТ_ДобавляемыеОбъекты.ПредставлениеКоманды КАК ПредставлениеКоманды,
	               |	ВТ_ДобавляемыеОбъекты.Расположение КАК Расположение
	               |ИЗ
	               |	ВТ_ДобавляемыеОбъекты КАК ВТ_ДобавляемыеОбъекты
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Расположение,
	               |	Индекс";
	
	Запрос.УстановитьПараметр("мОбъектыДобавить", мОбъектыДобавить);	
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	//Сначала обработаем иерархию
	ДеревоГрупп = ПакетРезультатов[1].Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ДобавитьГруппыНаФорму(ДеревоГрупп);
	
	ВыборкаКоманды =  ПакетРезультатов[2].Выбрать();
	
	Пока ВыборкаКоманды.Следующий() Цикл
		
		ИмяКоманды 	= ПолучитьИмяКомандыВнешнего(ВыборкаКоманды.ПодключаемыйОбъект.УникальныйИдентификатор(), ВыборкаКоманды.Расположение ,  ВыборкаКоманды.ИмяКоманды);
		
		ИмяКартинки = ВыборкаКоманды.ИмяКартинки;

		Если ЗначениеЗаполнено(ИмяКартинки) Тогда
			КартинкаКоманды = БиблиотекаКартинок[ИмяКартинки];
		Иначе
			КартинкаКоманды = БиблиотекаКартинок.Отчет;
		КонецЕсли;  
		
		ПараметрыКнопки = новый Структура;
		ПараметрыКнопки.Вставить("Имя"			, ИмяКоманды);
		ПараметрыКнопки.Вставить("ИмяКоманды"	, "ОбработатьВызовПодключаемогоОбъекта");
		ПараметрыКнопки.Вставить("Заголовок"	, ВыборкаКоманды.ПредставлениеКоманды);
		ПараметрыКнопки.Вставить("Картинка"		, КартинкаКоманды);
		
		ДобавитьКнопкуНаФорму(ПараметрыКнопки, ВыборкаКоманды.Расположение);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяКомандыВнешнего(УИДОбъекта, Расположение, ИмяКоманды)
	
	стрУИД = СтрЗаменить(УИДОбъекта,"-","_");
	Возврат	ИмяКоманды+"_"+Формат(Расположение.Код,"ЧГ=0")+"_УИД_"+стрУИД;  
	
КонецФункции

&НаСервере
Процедура ДобавитьГруппыНаФорму(СтрокиДерева)
	
	Для Каждого СтрокаДерева из СтрокиДерева.Строки Цикл
		
		Если СтрокаДерева.ГруппаФормы.Предопределенный Тогда
			//предопределенные группы уже есть
			ДобавитьГруппыНаФорму(СтрокаДерева);
		Иначе
			
			Если СтрокаДерева.Родитель.ГруппаФормы.Предопределенный Тогда
				ИмяЭлементаГруппы = СтрокаДерева.Родитель.ГруппаФормы.ИмяПредопределенныхДанных;
			Иначе
				ИмяЭлементаГруппы = ПолучитьИмяЭлемента(СтрокаДерева.Родитель.ГруппаФормы); 
			КонецЕсли;
			
			ГруппаРодитель = Элементы.Найти(ИмяЭлементаГруппы);
			
			Если ГруппаРодитель <> Неопределено Тогда
				
				ИмяГруппы =  ПолучитьИмяЭлемента(СтрокаДерева.ГруппаФормы);
				
				Если Элементы.Найти(ИмяГруппы) = Неопределено Тогда
					
					//Добавлеем элемент на форму
					ЭлементГруппа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), ГруппаРодитель);
					ЭлементГруппа.Вид 					= ВидГруппыФормы.ОбычнаяГруппа;
					ЭлементГруппа.Отображение 			= ОтображениеОбычнойГруппы.ОбычноеВыделение;
					ЭлементГруппа.Заголовок 			= " "+СтрокаДерева.ГруппаФормы.Наименование;
					ЭлементГруппа.ОтображатьЗаголовок 	= истина;
					ЭлементГруппа.Группировка 			= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
					ЭлементГруппа.ШрифтЗаголовка		= Новый Шрифт(ЭлементГруппа.ШрифтЗаголовка,,,Истина); 
					
				КонецЕсли;
			
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	
КонецПроцедуры

&наСервере
Процедура ОбработатьУдалениеЭлемента(ИмяКоманды)
	
	ЭлементФормы = Элементы.Найти(ИмяКоманды);
	
	Если ЭлементФормы <> Неопределено Тогда
		Элементы.Удалить(ЭлементФормы);
	КонецЕсли;
	
	КомандаФормы = Команды.Найти(ИмяКоманды);
	Если КомандаФормы <> Неопределено Тогда
		Команды.Удалить(КомандаФормы);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьКнопкуНаФорму(ПараметрыКнопки, Расположение)
	
	Если Расположение.Предопределенный Тогда
		ИмяЭлементаГруппы =  Расположение.ИмяПредопределенныхДанных;
	Иначе
		ИмяЭлементаГруппы =  ПолучитьИмяЭлемента(Расположение);
	КонецЕсли;
		
	РасположениеКоманды = Элементы.Найти(ИмяЭлементаГруппы);
	
	//Ссмылки на форме
	НайденныйЭлемент =  Элементы.Найти(ПараметрыКнопки.Имя);
	
	Если НайденныйЭлемент <> Неопределено Тогда
		Элементы.Удалить(НайденныйЭлемент);
	КонецЕсли;
	
	// создадим кнопку
	НовыйЭлемент        = Элементы.Добавить(ПараметрыКнопки.Имя 	,  	// Первый параметр - имя кнопки
											Тип("КнопкаФормы")		,  	// Второй параметр - тип элемента управления
											РасположениеКоманды)	;	// Третий параметр - место расположения на форме
	
	НовыйЭлемент.Вид    		= ВидКнопкиФормы.Гиперссылка; // вид кнопки
	НовыйЭлемент.Заголовок  	= ПараметрыКнопки.Заголовок;
	НовыйЭлемент.ИмяКоманды 	= ПараметрыКнопки.ИмяКоманды;
	НовыйЭлемент.Картинка 		= ПараметрыКнопки.Картинка;
	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьИмяЭлемента(РазмещениеСсылка)
	
	Возврат "Группа_"+СтрЗаменить(СокрЛП(РазмещениеСсылка.УникальныйИдентификатор()),"-","_");
	
КонецФункции

&НаСервере
Функция ПолучитьДаныеОбъекта(стр_УИД_Элемента)
	
	стр_УИД = СтрЗаменить(стр_УИД_Элемента,"_","-");
	
	ПодключаемыйОбъект = Справочники.CW_ПодключаемыеОбъекты.ПолучитьСсылку(Новый УникальныйИдентификатор(стр_УИД));
	
	Если ПодключаемыйОбъект.Пустая() Тогда
		//Странно
		Возврат Неопределено;
	Конецесли;
	
	СтруктураДанныхОбъекта = Новый Структура("ПодключаемыйОбъект,Метод,ИмяФормы",ПодключаемыйОбъект,"","");
	
	//Методы
	мМетодыОбъекта = ПодключаемыйОбъект.МетодыОбъекта.ВыгрузитьКолонку("Метод");
	
	Если мМетодыОбъекта.Найти("ОткрытьФорму") <> Неопределено Тогда
		СтруктураДанныхОбъекта.Метод = "ОткрытьФорму";
	ИначеЕсли мМетодыОбъекта.Найти("ВыполнитьКлиентскийМетод") <> Неопределено Тогда
		СтруктураДанныхОбъекта.Метод = "ВыполнитьКлиентскийМетод";
	Иначе
		//Неизвестный метод формы
		Возврат Неопределено;
	Конецесли;
	
	_ПО.ПодключитьОбработку(ПодключаемыйОбъект);
	СтруктураДанныхОбъекта.ИмяФормы = _ПО.ПолучитьПолноеИмяФормыПоТипу(ПодключаемыйОбъект,"ФормаОбъекта");
	
	Возврат СтруктураДанныхОбъекта;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВызовПодключаемогоОбъекта(Команда) 
	
	ИмяЭлемента = Этаформа.ТекущийЭлемент.Имя;
	
	СтрокаИмениКоманды = СтрЗаменить(ИмяЭлемента,"_УИД_",";");
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрокаИмениКоманды,";");
	
	Если МассивСтрок.Количество() = 2 Тогда 
		стр_УИД_Элемента = МассивСтрок[1];
	Иначе 
		Возврат;
	КонецЕсли;
	
	// открываем форму
	СтруктураДанныхОбъекта = ПолучитьДаныеОбъекта(стр_УИД_Элемента);
	
	Если СтруктураДанныхОбъекта = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтруктураДанныхОбъекта.Метод = "ОткрытьФорму" Тогда
		
		ЭтоВнешнийОтчет = ПолучитьВидОбъекта(СтруктураДанныхОбъекта.ПодключаемыйОбъект);
		ОткрытьФорму(СтруктураДанныхОбъекта.ИмяФормы,СтруктураДанныхОбъекта,,?(ЭтоВнешнийОтчет, Новый УникальныйИдентификатор,Неопределено),,,,РежимОткрытияОкнаФормы.Независимый);
		
	ИначеЕсли  СтруктураДанныхОбъекта.Метод = "ВыполнитьКлиентскийМетод" Тогда
		
		ФормаОбъекта = ПолучитьФорму(СтруктураДанныхОбъекта.ИмяФормы, СтруктураДанныхОбъекта);
		ФормаОбъекта.ВыполнитьКлиентскийМетод();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьВидОбъекта(ПодключаемыйОбъект)
	
	Возврат	ПодключаемыйОбъект.Вид = "ВнешнийОтчет";
	
КонецФункции

#КонецОбласти
	
&НаКлиенте
Процедура ДекорацияОПрограммеНажатие(Элемент)

	ОткрытьФорму("ОбщаяФорма.CW_ИнформацияОПрограмме",,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

//Подсистема.ЛичныйКабинет
&НаКлиенте
Процедура ЗапуститьРекламныйБаннерЛКК()
	
	ОткрытьФорму("ОбщаяФорма.CW_ЛичныйКабинетРекламныйБаннер");
	
КонецПроцедуры
//Подсистема.ЛичныйКабинет 

//Подсистема.CW_РеестрыНДС0
&НаКлиенте
Процедура ЗапуститьРекламныйБаннерРеестрыНДС0()
	
	ОткрытьФорму("ОбщаяФорма.CW_РеестрыНДС0РекламныйБаннер");
	
КонецПроцедуры 
//Подсистема.CW_РеестрыНДС0

//Подсистема.CW_ДоходыНерезидентов
&НаКлиенте
Процедура ЗапуститьРекламныйБаннерДоходыНерезидентов()
	
	ОткрытьФорму("ОбщаяФорма.CW_ДоходыНерезидентовРекламныйБаннер");
	
КонецПроцедуры 
//Подсистема.CW_ДоходыНерезидентов

&НаКлиенте
Процедура АвторизацияНаСайтеТехподдержки(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗавершитьВводЛогинаИПароля", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.CW_ФормаЛогинПароль",,ЭтаФорма,,,,Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьВводЛогинаИПароля(Результат, дополнительныеПараметры) Экспорт 
	
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкаСервиса(Команда)

	ОткрытьФорму("ОбщаяФорма.CW_ЛичныйКабинетНастройки",,ЭтаФорма);

КонецПроцедуры

&НаКлиенте
Процедура КомандаРуководствоПользователя(Команда)  
	
	ЗапуститьПриложение("http://www.coralway.ru/products/programs_cw/AF8/UserGuide/UserGuide_AFLK_RU.pdf");
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьИсправленияНажатие(Элемент)  
	
	Если НЕ ПроверитьПодключениеНаСервере() Тогда  
		Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВводаЛогинаИПароля", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Не удалось подключиться к серверу техподдержки! Проверьте правильность введенных данных",60,"Проверка подключения");
	Иначе 
		ОткрытьФормуЗагрузкиИсправлений();
	КонецЕсли;  
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьОбязателныеРасширенияНажатие(Элемент)

	Если НЕ ПроверитьПодключениеНаСервере() Тогда  
		Оповещение = Новый ОписаниеОповещения("ОткрытьФормуВводаЛогинаИПароля", ЭтотОбъект);
		ПоказатьПредупреждение(Оповещение,"Не удалось подключиться к серверу техподдержки! Проверьте правильность введенных данных",60,"Проверка подключения");
	Иначе 
		ОткрытьФормуЗагрузкиИсправлений();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НадписьДоступнаНоваяВерсияНажатие(Элемент)
	
	ОписаниеВерсии = ПолучитьURLНовойВерсии(НоваяВерсия);

	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗапускаОписанияВерсии", ЭтотОбъект);
	
	НачатьЗапускПриложения(ОписаниеОповещения,ОписаниеВерсии,, Ложь);
	
КонецПроцедуры 

&НаСервере
Функция ПолучитьURLНовойВерсии(Версия)
	
	Возврат CW_МониторПорталаПоддержкиСервер.ПолучитьURLНовойВерсии(НоваяВерсия);
	
КонецФункции


&НаКлиенте
Процедура ПослеЗапускаОписанияВерсии(КодВозврата, ДополнительныеПараметры) Экспорт
	
	
КонецПроцедуры
